{"id":56,"document_id":56,"name":"Report for output3_X6Vaw8b.txt","byline":"djangoSuperuser on 2023-07-07 01:51:00 UTC","accepted_sentences":1,"reviewing_sentences":6,"total_sentences":7,
"text":"Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. Most systems come with some built-in command-line interface and scripting capabilities, for example, macOS and Linux distributions include some flavor of Unix Shell while Windows installations include the Windows Command Shell and PowerShell.\n\nThere are also cross-platform interpreters such as Python, as well as those commonly associated with client applications such as JavaScript and Visual Basic.\n\nAdversaries may abuse these technologies in various ways as a means of executing arbitrary commands. Commands and scripts can be embedded in Initial Access payloads delivered to victims as lure documents or as secondary payloads downloaded from an existing C2. Adversaries may also execute commands through interactive terminals/shells, as well as utilize various Remote Services in order to achieve remote Execution.",
"ml_model":"LogisticRegressionModel","created_by":2,"created_on":"2023-07-07T01:51:00.041544Z","updated_on":"2023-07-07T01:51:00.041600Z","status":"Reviewing"
,"sentences":[
    {"id":37221,"text":"Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries.","order":0,"disposition":null,"mappings":[{"id":9524,"attack_id":"T1059","name":"Command and Scripting Interpreter","confidence":"91.6"}]},
    {"id":37222,"text":"These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms.","order":1,"disposition":null,"mappings":[]},
    {"id":37223,"text":"Most systems come with some built-in command-line interface and scripting capabilities, for example, macOS and Linux distributions include some flavor of Unix Shell while Windows installations include the Windows Command Shell and PowerShell.","order":2,"disposition":"accept","mappings":[{"id":9525,"attack_id":"T1059","name":"Command and Scripting Interpreter","confidence":"99.6"}]},
    {"id":37224,"text":"There are also cross-platform interpreters such as Python, as well as those commonly associated with client applications such as JavaScript and Visual Basic.","order":3,"disposition":null,"mappings":[{"id":9526,"attack_id":"T1059","name":"Command and Scripting Interpreter","confidence":"34.8"}]},
    {"id":37225,"text":"Adversaries may abuse these technologies in various ways as a means of executing arbitrary commands.","order":4,"disposition":null,"mappings":[]},
    {"id":37226,"text":"Commands and scripts can be embedded in Initial Access payloads delivered to victims as lure documents or as secondary payloads downloaded from an existing C2.","order":5,"disposition":null,"mappings":[{"id":9527,"attack_id":"T1059","name":"Command and Scripting Interpreter","confidence":"38.0"}]},
    {"id":37227,"text":"Adversaries may also execute commands through interactive terminals/shells, as well as utilize various Remote Services in order to achieve remote Execution.","order":6,"disposition":null,"mappings":[{"id":9528,"attack_id":"T1059","name":"Command and Scripting Interpreter","confidence":"46.7"}]} ]}